Documents/ЗачислениеУчащихсяВУчебнуюГруппу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>ЗачислениеУчащихсяВУчебнуюГруппу</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.СоставГрупп</xr:Item>
				<xr:Item>InformationRegister.ЗачислениеУчащихся</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УчебнаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчебныеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Учащиеся</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Учащийся</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Учащиеся</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументОснованиеЗачисления</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Документы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/СоставГрупп.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>СоставГрупп</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Зачислен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>УчебнаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчебныеГруппы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Учащийся</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Учащиеся</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЗачислениеУчащихся.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>ЗачислениеУчащихся</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаЗачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументОснованиеЗачисления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Документы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>УчебнаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчебныеГруппы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Учащийся</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Учащиеся</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ЗачислениеУчащихсяВУчебнуюГруппу/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр СоставГрупп
	Движения.СоставГрупп.Записывать = Истина;
	Для Каждого ТекСтрокаУчащиеся Из Учащиеся Цикл
		Движение = Движения.СоставГрупп.Добавить();
		Движение.Период = Дата;
		Движение.УчебнаяГруппа = УчебнаяГруппа;
		Движение.Учащийся = ТекСтрокаУчащиеся.Учащийся;
		Движение.Зачислен = Истина;
	КонецЦикла;

	// регистр ЗачислениеУчащихся
	Движения.ЗачислениеУчащихся.Записывать = Истина;
	Для Каждого ТекСтрокаУчащиеся Из Учащиеся Цикл
		Движение = Движения.ЗачислениеУчащихся.Добавить();
		Движение.УчебнаяГруппа = УчебнаяГруппа;
		Движение.Учащийся = ТекСтрокаУчащиеся.Учащийся;
		Движение.ДатаЗачисления = Дата;
		Движение.ДокументОснованиеЗачисления = ТекСтрокаУчащиеся.ДокументОснованиеЗачисления;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
